{
    "_id": {
      "$oid": "68dccab7f3380e4f421bb45d"
    },
    "title": "Lt Gen Virendra Vats becomes Director General of National Cadet Corps",
    "source": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2173448",
    "content": "Lt Gen Virendra Vats became the Director General of the National Cadet Corps (NCC) on October 01, 2025, taking over from Lt Gen Gurbirpal Singh. He steps into the role when the NCC, the world’s largest uniformed youth organization, is growing its cadet numbers to 20 lakhs across 28 states and 8 Union Territories. With the motto Unity and Discipline, the NCC is moving forward with Viksit Bharat@2047, adding innovation, digital skills and global awareness to its long‑standing focus on character building and patriotism. He joined the 19 KUMAON Regiment of the Indian Army on December 17, 1988 and has 37 years of distinguished service. He has worked in tough Counter Insurgency and Counter Terrorism settings and has held important posts in Arunachal Pradesh, the Kashmir Valley, and Army Headquarters. He also led an Infantry Brigade in the United Nations mission in the Democratic Republic of Congo. Before this, he was the Commandant of the Defence Services Staff College in Wellington. He studied at the National Defence Academy, Khadakwasla; the Indian Military Academy, Dehradun; the College of Defence Management, Secunderabad; and the National Defence College, New Delhi. Lt Gen Virendra Vats has a broad background in operations and leadership. His experience and vision are expected to guide the NCC with fresh energy, strengthening its role in developing disciplined, responsible, and future‑ready youth for the country. *** SR/KB",
    "language": "English",
    "original_title": "Lt Gen Virendra Vats Takes Over as Director General of National Cadet Corps",
    "created_at": {
      "$date": "2025-10-01T06:31:19.097Z"
    },
    "type": "Ministry of Defence",
    "summary": "Lt Gen Virendra Vats has taken over as the Director General of the National Cadet Corps (NCC) as of October 01, 2025. He brings 37 years of distinguished service and a broad background in operations and leadership to the role.",
    "translations": [
      {
        "ln_code": "hi",
        "content": "लेफ्टिनेंट जनरल वीरेंद्र वत्स 01 अक्टूबर, 2025 को लेफ्टिनेंट जनरल गुरबीरपाल सिंह से पदभार ग्रहण करते हुए राष्ट्रीय कैडेट कोर (एनसीसी) के महानिदेशक बने। उन्होंने इस भूमिका में कदम तब रखा जब दुनिया का सबसे बड़ा वर्दीधारी युवा संगठन एनसीसी, 28 राज्यों और 8 केंद्र शासित प्रदेशों में अपने कैडेटों की संख्या 20 लाख तक बढ़ा रहा है। एकता और अनुशासन के आदर्श वाक्य के साथ, एनसीसी विकसित भारत@2047 के साथ आगे बढ़ रहा है, जिसमें चरित्र निर्माण और देशभक्ति पर अपने लंबे समय से केंद्रित फोकस में नवाचार, डिजिटल कौशल और वैश्विक जागरूकता शामिल है। वह 17 दिसंबर, 1988 को भारतीय सेना की 19 कुमाऊं रेजिमेंट में शामिल हुए और 37 साल की विशिष्ट सेवा की। उन्होंने उग्रवाद और आतंकवाद विरोधी कठिन सेटिंग्स में काम किया है और अरुणाचल प्रदेश, कश्मीर घाटी और सेना मुख्यालय में महत्वपूर्ण पदों पर कार्य किया है। उन्होंने कांगो लोकतांत्रिक गणराज्य में संयुक्त राष्ट्र मिशन में एक इन्फैंट्री ब्रिगेड का भी नेतृत्व किया। इससे पहले वह वेलिंगटन में डिफेंस सर्विसेज स्टाफ कॉलेज के कमांडेंट थे। उन्होंने राष्ट्रीय रक्षा अकादमी, खड़कवासला में अध्ययन किया; भारतीय सैन्य अकादमी, देहरादून; रक्षा प्रबंधन महाविद्यालय, सिकंदराबाद; और राष्ट्रीय रक्षा कॉलेज, नई दिल्ली। लेफ्टिनेंट जनरल वीरेंद्र वत्स की संचालन और नेतृत्व में व्यापक पृष्ठभूमि है। उनके अनुभव और दूरदृष्टि से एनसीसी को नई ऊर्जा के साथ मार्गदर्शन करने और देश के लिए अनुशासित, जिम्मेदार और भविष्य के लिए तैयार युवाओं को विकसित करने में इसकी भूमिका को मजबूत करने की उम्मीद है। *** एसआर/केबी",
        "title": "लेफ्टिनेंट जनरल वीरेंद्र वत्स राष्ट्रीय कैडेट कोर के महानिदेशक बने",
        "summary": "लेफ्टिनेंट जनरल वीरेंद्र वत्स ने 01 अक्टूबर, 2025 को राष्ट्रीय कैडेट कोर (एनसीसी) के महानिदेशक के रूप में पदभार संभाला है। वह 37 साल की विशिष्ट सेवा और संचालन और नेतृत्व में एक व्यापक पृष्ठभूमि लेकर आए हैं।",
        "type": "रक्षा मंत्रालय"
      },
      {
        "ln_code": "bn",
        "content": "লেফটেন্যান্ট জেনারেল বীরেন্দ্র ভাটস 01 অক্টোবর, 2025 তারিখে লেফটেন্যান্ট জেনারেল গুরবীরপাল সিংয়ের কাছ থেকে দায়িত্ব গ্রহণ করে ন্যাশনাল ক্যাডেট কর্পস (এনসিসি) এর মহাপরিচালক হন। তিনি এই ভূমিকায় অবতীর্ণ হন যখন NCC, বিশ্বের বৃহত্তম ইউনিফর্মধারী যুব সংগঠন, 28টি রাজ্য এবং 8টি কেন্দ্রশাসিত অঞ্চলে তার ক্যাডেটের সংখ্যা 20 লক্ষে উন্নীত করছে। ঐক্য এবং শৃঙ্খলার মূলমন্ত্রের সাথে, NCC Viksit Bharat@2047-এর সাথে এগিয়ে যাচ্ছে, চরিত্র গঠন এবং দেশপ্রেমের উপর দীর্ঘস্থায়ী ফোকাসের সাথে উদ্ভাবন, ডিজিটাল দক্ষতা এবং বিশ্ব সচেতনতা যোগ করছে। তিনি 17 ডিসেম্বর, 1988-এ ভারতীয় সেনাবাহিনীর 19 কুমাওন রেজিমেন্টে যোগদান করেন এবং 37 বছর বিশিষ্ট চাকরি করেন। তিনি কঠোর কাউন্টার ইনসারজেন্সি এবং কাউন্টার টেররিজম সেটিংসে কাজ করেছেন এবং অরুণাচল প্রদেশ, কাশ্মীর উপত্যকা এবং সেনা সদর দফতরে গুরুত্বপূর্ণ পদে অধিষ্ঠিত হয়েছেন। তিনি গণতান্ত্রিক প্রজাতন্ত্র কঙ্গোতে জাতিসংঘ মিশনে একটি পদাতিক ব্রিগেডের নেতৃত্ব দিয়েছেন। এর আগে তিনি ওয়েলিংটনের ডিফেন্স সার্ভিসেস স্টাফ কলেজের কমান্ড্যান্ট ছিলেন। তিনি ন্যাশনাল ডিফেন্স একাডেমি, খাদকওয়াসলা থেকে পড়াশোনা করেছেন; ইন্ডিয়ান মিলিটারি একাডেমি, দেরাদুন; কলেজ অফ ডিফেন্স ম্যানেজমেন্ট, সেকেন্দ্রাবাদ; এবং ন্যাশনাল ডিফেন্স কলেজ, নয়াদিল্লি। লেফটেন্যান্ট জেনারেল বীরেন্দ্র ভাটস অপারেশন এবং নেতৃত্বের একটি বিস্তৃত পটভূমি রয়েছে। তার অভিজ্ঞতা এবং দৃষ্টিভঙ্গি দেশের জন্য শৃঙ্খলাবদ্ধ, দায়িত্বশীল এবং ভবিষ্যৎ-প্রস্তুত যুবকদের গড়ে তোলার ক্ষেত্রে এনসিসিকে তাজা শক্তি দিয়ে পথ দেখাবে বলে আশা করা হচ্ছে। *** এসআর/কেবি",
        "title": "লেফটেন্যান্ট জেনারেল বীরেন্দ্র ভাটস জাতীয় ক্যাডেট কোরের মহাপরিচালক হন",
        "summary": "লেফটেন্যান্ট জেনারেল বীরেন্দ্র ভাটস 01 অক্টোবর, 2025 সাল পর্যন্ত ন্যাশনাল ক্যাডেট কর্পস (NCC) এর মহাপরিচালক হিসাবে দায়িত্ব গ্রহণ করেছেন। তিনি 37 বছরের বিশিষ্ট পরিষেবা এবং ভূমিকায় অপারেশন এবং নেতৃত্বের একটি বিস্তৃত পটভূমি নিয়ে আসেন।",
        "type": "প্রতিরক্ষা মন্ত্রণালয়"
      },
      {
        "ln_code": "gu",
        "content": "લેફ્ટનન્ટ જનરલ વીરેન્દ્ર વત્સ 01 ઓક્ટોબર, 2025 ના રોજ લેફ્ટનન્ટ જનરલ ગુરબીરપાલ સિંહ પાસેથી પદ સંભાળીને નેશનલ કેડેટ કોર્પ્સ (NCC) ના ડિરેક્ટર જનરલ બન્યા. જ્યારે NCC, વિશ્વની સૌથી મોટી ગણવેશધારી યુવા સંસ્થા, 28 રાજ્યો અને 8 કેન્દ્રશાસિત પ્રદેશોમાં તેની કેડેટની સંખ્યા વધારીને 20 લાખ કરી રહી છે ત્યારે તે ભૂમિકામાં આવે છે. એકતા અને શિસ્તના સૂત્ર સાથે, NCC Viksit Bharat@2047 સાથે આગળ વધી રહ્યું છે, જેમાં ચારિત્ર્ય નિર્માણ અને દેશભક્તિ પર તેના લાંબા સમયથી ધ્યાન કેન્દ્રિત કરવા માટે નવીનતા, ડિજિટલ કૌશલ્યો અને વૈશ્વિક જાગૃતિ ઉમેરવામાં આવી રહી છે. તેઓ 17 ડિસેમ્બર, 1988ના રોજ ભારતીય સૈન્યની 19 કુમાઉ રેજિમેન્ટમાં જોડાયા હતા અને તેમની 37 વર્ષની વિશિષ્ટ સેવા છે. તેમણે કઠિન કાઉન્ટર ઇન્સર્જન્સી અને કાઉન્ટર ટેરરિઝમ સેટિંગ્સમાં કામ કર્યું છે અને અરુણાચલ પ્રદેશ, કાશ્મીર ખીણ અને આર્મી હેડક્વાર્ટરમાં મહત્વપૂર્ણ હોદ્દાઓ સંભાળ્યા છે. તેમણે ડેમોક્રેટિક રિપબ્લિક ઓફ કોંગોમાં સંયુક્ત રાષ્ટ્રના મિશનમાં ઇન્ફન્ટ્રી બ્રિગેડનું નેતૃત્વ પણ કર્યું હતું. આ પહેલા તેઓ વેલિંગ્ટનમાં ડિફેન્સ સર્વિસ સ્ટાફ કોલેજના કમાન્ડન્ટ હતા. તેમણે નેશનલ ડિફેન્સ એકેડેમી, ખડકવાસલામાં અભ્યાસ કર્યો; ઇન્ડિયન મિલિટરી એકેડમી, દેહરાદૂન; કોલેજ ઓફ ડિફેન્સ મેનેજમેન્ટ, સિકંદરાબાદ; અને નેશનલ ડિફેન્સ કોલેજ, નવી દિલ્હી. લેફ્ટનન્ટ જનરલ વીરેન્દ્ર વત્સની કામગીરી અને નેતૃત્વમાં વ્યાપક પૃષ્ઠભૂમિ છે. તેમનો અનુભવ અને દ્રષ્ટિ એનસીસીને નવી ઉર્જા સાથે માર્ગદર્શન આપે તેવી અપેક્ષા છે, જે દેશ માટે શિસ્તબદ્ધ, જવાબદાર અને ભવિષ્ય માટે તૈયાર યુવાનોના વિકાસમાં તેની ભૂમિકાને મજબૂત કરશે. *** SR/KB",
        "title": "લેફ્ટનન્ટ જનરલ વીરેન્દ્ર વત્સ નેશનલ કેડેટ કોર્પ્સના ડાયરેક્ટર જનરલ બન્યા",
        "summary": "લેફ્ટનન્ટ જનરલ વીરેન્દ્ર વત્સે ઓક્ટોબર 01, 2025 ના રોજ નેશનલ કેડેટ કોર્પ્સ (NCC) ના મહાનિર્દેશક તરીકેનો કાર્યભાર સંભાળ્યો છે. તેઓ 37 વર્ષની વિશિષ્ટ સેવા અને કામગીરી અને નેતૃત્વની ભૂમિકામાં વ્યાપક પૃષ્ઠભૂમિ લાવે છે.",
        "type": "સંરક્ષણ મંત્રાલય"
      },
      {
        "ln_code": "ta",
        "content": "லெப்டினன்ட் ஜெனரல் குர்பீர்பால் சிங்கிடம் இருந்து அக்டோபர் 01, 2025 அன்று லெப்டினன்ட் ஜெனரல் வீரேந்திர வாட்ஸ், தேசிய கேடட் கார்ப்ஸின் (என்சிசி) டைரக்டர் ஜெனரல் ஆனார். உலகின் மிகப்பெரிய சீருடை அணிந்த இளைஞர் அமைப்பான என்சிசி, 28 மாநிலங்கள் மற்றும் 8 யூனியன் பிரதேசங்களில் தனது கேடட் எண்ணிக்கையை 20 லட்சமாக உயர்த்திக் கொண்டிருக்கும் போது அவர் அந்தப் பாத்திரத்தில் இறங்கினார். ஒற்றுமை மற்றும் ஒழுக்கம் என்ற குறிக்கோளுடன், என்சிசி விக்சித் பாரத்@2047 உடன் முன்னேறி வருகிறது, புதுமை, டிஜிட்டல் திறன்கள் மற்றும் உலகளாவிய விழிப்புணர்வை குணாதிசயம் மற்றும் தேசபக்தியில் நீண்டகாலமாக கவனம் செலுத்துகிறது. அவர் டிசம்பர் 17, 1988 இல் இந்திய இராணுவத்தின் 19 குமாவோன் படைப்பிரிவில் சேர்ந்தார் மற்றும் 37 ஆண்டுகள் புகழ்பெற்ற சேவையைப் பெற்றுள்ளார். அவர் கடுமையான எதிர்ப்பு கிளர்ச்சி மற்றும் பயங்கரவாத எதிர்ப்பு அமைப்புகளில் பணியாற்றியுள்ளார் மற்றும் அருணாச்சல பிரதேசம், காஷ்மீர் பள்ளத்தாக்கு மற்றும் இராணுவ தலைமையகத்தில் முக்கிய பதவிகளை வகித்துள்ளார். காங்கோ ஜனநாயகக் குடியரசில் ஐக்கிய நாடுகளின் பணியில் காலாட்படைப் படையையும் அவர் வழிநடத்தினார். இதற்கு முன், வெலிங்டனில் உள்ள பாதுகாப்பு சேவைகள் பணியாளர் கல்லூரியின் கமாண்டன்டாக இருந்தார். அவர் தேசிய பாதுகாப்பு அகாடமி, கடக்வாஸ்லாவில் படித்தார்; இந்திய ராணுவ அகாடமி, டேராடூன்; பாதுகாப்பு மேலாண்மை கல்லூரி, செகந்திராபாத்; மற்றும் தேசிய பாதுகாப்பு கல்லூரி, புது தில்லி. லெப்டினன்ட் ஜெனரல் வீரேந்திர வாட்ஸ் செயல்பாடுகள் மற்றும் தலைமைத்துவத்தில் பரந்த பின்னணியைக் கொண்டவர். அவரது அனுபவமும் தொலைநோக்கு பார்வையும் NCC க்கு புதிய ஆற்றலுடன் வழிகாட்டும் என எதிர்பார்க்கப்படுகிறது, நாட்டின் ஒழுக்கமான, பொறுப்புள்ள மற்றும் எதிர்காலத்திற்குத் தயாராக இருக்கும் இளைஞர்களை வளர்ப்பதில் அதன் பங்கை வலுப்படுத்துகிறது. *** எஸ்ஆர்/கேபி",
        "title": "லெப்டினன்ட் ஜெனரல் வீரேந்திர வாட்ஸ் தேசிய கேடட் கார்ப்ஸின் டைரக்டர் ஜெனரலாக ஆனார்",
        "summary": "லெப்டினன்ட் ஜெனரல் வீரேந்திர வாட்ஸ் அக்டோபர் 01, 2025 இல் தேசிய கேடட் கார்ப்ஸின் (NCC) டைரக்டர் ஜெனரலாக பொறுப்பேற்றுள்ளார்.",
        "type": "பாதுகாப்பு அமைச்சகம்"
      },
      {
        "ln_code": "te",
        "content": "లెఫ్టినెంట్ జనరల్ వీరేంద్ర వాట్స్ అక్టోబర్ 01, 2025న లెఫ్టినెంట్ జనరల్ గుర్బీర్‌పాల్ సింగ్ నుండి బాధ్యతలు స్వీకరించి నేషనల్ క్యాడెట్ కార్ప్స్ (NCC) డైరెక్టర్ జనరల్ అయ్యారు. ప్రపంచంలోనే అతిపెద్ద యూనిఫాం యువర్ ఆర్గనైజేషన్ అయిన NCC 28 రాష్ట్రాలు మరియు 8 కేంద్ర పాలిత ప్రాంతాలలో తన క్యాడెట్ సంఖ్యలను 20 లక్షలకు పెంచుతున్నప్పుడు ఆయన ఆ పాత్రలోకి అడుగుపెట్టారు. ఐక్యత మరియు క్రమశిక్షణ అనే నినాదంతో, ఎన్‌సిసి విక్షిత్ భారత్@2047తో ముందుకు సాగుతోంది, పాత్రల నిర్మాణం మరియు దేశభక్తిపై దీర్ఘకాల దృష్టికి ఆవిష్కరణ, డిజిటల్ నైపుణ్యాలు మరియు ప్రపంచ అవగాహనను జోడిస్తుంది. అతను డిసెంబర్ 17, 1988 న ఇండియన్ ఆర్మీ యొక్క 19 కుమావోన్ రెజిమెంట్‌లో చేరాడు మరియు 37 సంవత్సరాల విశిష్ట సేవను కలిగి ఉన్నాడు. అతను కఠినమైన కౌంటర్ తిరుగుబాటు మరియు కౌంటర్ టెర్రరిజం సెట్టింగులలో పనిచేశాడు మరియు అరుణాచల్ ప్రదేశ్, కాశ్మీర్ లోయ మరియు ఆర్మీ ప్రధాన కార్యాలయాలలో ముఖ్యమైన పదవులను నిర్వహించాడు. డెమొక్రాటిక్ రిపబ్లిక్ ఆఫ్ కాంగోలో ఐక్యరాజ్యసమితి మిషన్‌లో అతను పదాతిదళ బ్రిగేడ్‌కు కూడా నాయకత్వం వహించాడు. దీనికి ముందు, అతను వెల్లింగ్టన్‌లోని డిఫెన్స్ సర్వీసెస్ స్టాఫ్ కాలేజీకి కమాండెంట్‌గా ఉన్నాడు. అతను నేషనల్ డిఫెన్స్ అకాడమీ, ఖడక్వాస్లాలో చదువుకున్నాడు; ఇండియన్ మిలిటరీ అకాడమీ, డెహ్రాడూన్; కాలేజ్ ఆఫ్ డిఫెన్స్ మేనేజ్‌మెంట్, సికింద్రాబాద్; మరియు నేషనల్ డిఫెన్స్ కాలేజీ, న్యూఢిల్లీ. లెఫ్టినెంట్ జనరల్ వీరేంద్ర వాట్స్‌కు కార్యకలాపాలు మరియు నాయకత్వంలో విస్తృత నేపథ్యం ఉంది. అతని అనుభవం మరియు దార్శనికత NCCకి తాజా శక్తితో మార్గనిర్దేశం చేస్తుందని, దేశం కోసం క్రమశిక్షణ కలిగిన, బాధ్యతాయుతమైన మరియు భవిష్యత్తుకు సిద్ధంగా ఉన్న యువతను అభివృద్ధి చేయడంలో దాని పాత్రను బలోపేతం చేస్తుందని భావిస్తున్నారు. *** SR/KB",
        "title": "లెఫ్టినెంట్ జనరల్ వీరేంద్ర వాట్స్ నేషనల్ క్యాడెట్ కార్ప్స్ డైరెక్టర్ జనరల్ అయ్యారు",
        "summary": "లెఫ్టినెంట్ జనరల్ వీరేంద్ర వాట్స్ అక్టోబర్ 01, 2025 నాటికి నేషనల్ క్యాడెట్ కార్ప్స్ (NCC) డైరెక్టర్ జనరల్‌గా బాధ్యతలు స్వీకరించారు. అతను 37 సంవత్సరాల విశిష్ట సేవలను మరియు కార్యకలాపాలు మరియు నాయకత్వంలో విస్తృత నేపథ్యాన్ని కలిగి ఉన్నాడు.",
        "type": "రక్షణ మంత్రిత్వ శాఖ"
      },
      {
        "ln_code": "ml",
        "content": "ലഫ്റ്റനൻ്റ് ജനറൽ ഗുർബീർപാൽ സിങ്ങിൽ നിന്ന് ചുമതലയേറ്റ ലഫ്റ്റനൻ്റ് ജനറൽ വീരേന്ദ്ര വാട്‌സ് 2025 ഒക്ടോബർ 01-ന് നാഷണൽ കേഡറ്റ് കോർപ്‌സിൻ്റെ (എൻസിസി) ഡയറക്ടർ ജനറലായി. ലോകത്തിലെ ഏറ്റവും വലിയ യൂണിഫോം ധരിച്ച യുവജന സംഘടനയായ എൻസിസി 28 സംസ്ഥാനങ്ങളിലും 8 കേന്ദ്രഭരണ പ്രദേശങ്ങളിലുമായി കേഡറ്റുകളുടെ എണ്ണം 20 ലക്ഷമായി ഉയർത്തുമ്പോൾ അദ്ദേഹം ഈ റോളിലേക്ക് ചുവടുവെക്കുന്നു. ഐക്യവും അച്ചടക്കവും എന്ന മുദ്രാവാക്യവുമായി എൻസിസി, വിക്ഷിത് ഭാരത്@2047-നൊപ്പം, സ്വഭാവ രൂപീകരണത്തിലും ദേശസ്‌നേഹത്തിലും ദീർഘകാല ശ്രദ്ധ കേന്ദ്രീകരിച്ച് നവീകരണവും ഡിജിറ്റൽ വൈദഗ്ധ്യവും ആഗോള അവബോധവും ചേർത്തുകൊണ്ട് മുന്നേറുകയാണ്. 1988 ഡിസംബർ 17-ന് ഇന്ത്യൻ കരസേനയുടെ 19 കുമയോൺ റെജിമെൻ്റിൽ ചേർന്ന അദ്ദേഹം 37 വർഷത്തെ വിശിഷ്ട സേവനത്തിനുണ്ട്. കഠിനമായ വിരുദ്ധ കലാപത്തിലും തീവ്രവാദ വിരുദ്ധ ക്രമീകരണങ്ങളിലും പ്രവർത്തിച്ച അദ്ദേഹം അരുണാചൽ പ്രദേശ്, കശ്മീർ താഴ്‌വര, സൈനിക ആസ്ഥാനം എന്നിവിടങ്ങളിൽ സുപ്രധാന പദവികൾ വഹിച്ചിട്ടുണ്ട്. ഡെമോക്രാറ്റിക് റിപ്പബ്ലിക് ഓഫ് കോംഗോയിലെ യുഎൻ ദൗത്യത്തിൽ അദ്ദേഹം ഒരു ഇൻഫൻട്രി ബ്രിഗേഡിനെ നയിച്ചു. ഇതിന് മുമ്പ് വെല്ലിംഗ്ടണിലെ ഡിഫൻസ് സർവീസസ് സ്റ്റാഫ് കോളേജിൻ്റെ കമാൻഡൻ്റായിരുന്നു. ഖഡക്വാസ്ലയിലെ നാഷണൽ ഡിഫൻസ് അക്കാദമിയിൽ പഠിച്ചു; ഇന്ത്യൻ മിലിട്ടറി അക്കാദമി, ഡെറാഡൂൺ; കോളേജ് ഓഫ് ഡിഫൻസ് മാനേജ്മെൻ്റ്, സെക്കന്തരാബാദ്; നാഷണൽ ഡിഫൻസ് കോളേജ്, ന്യൂഡൽഹി. ലഫ്റ്റനൻ്റ് ജനറൽ വീരേന്ദ്ര വാറ്റ്സിന് പ്രവർത്തനങ്ങളിലും നേതൃത്വത്തിലും വിശാലമായ പശ്ചാത്തലമുണ്ട്. അദ്ദേഹത്തിൻ്റെ അനുഭവവും ദർശനവും എൻസിസിയെ പുത്തൻ ഊർജത്തോടെ നയിക്കുമെന്നും രാജ്യത്തിന് വേണ്ടി അച്ചടക്കമുള്ള, ഉത്തരവാദിത്തമുള്ള, ഭാവിയിൽ തയ്യാറുള്ള യുവാക്കളെ വികസിപ്പിക്കുന്നതിൽ അതിൻ്റെ പങ്ക് ശക്തിപ്പെടുത്തുമെന്നും പ്രതീക്ഷിക്കുന്നു. *** SR/KB",
        "title": "ലഫ്റ്റനൻ്റ് ജനറൽ വീരേന്ദ്ര വാട്‌സ് നാഷണൽ കേഡറ്റ് കോർപ്‌സിൻ്റെ ഡയറക്ടർ ജനറലായി",
        "summary": "2025 ഒക്‌ടോബർ 01-ന് നാഷണൽ കേഡറ്റ് കോർപ്‌സിൻ്റെ (എൻസിസി) ഡയറക്ടർ ജനറലായി ലെഫ്റ്റനൻ്റ് ജനറൽ വീരേന്ദ്ര വാട്‌സ് ചുമതലയേറ്റു. 37 വർഷത്തെ വിശിഷ്ട സേവനവും പ്രവർത്തനങ്ങളിലും നേതൃത്വത്തിലും വിശാലമായ പശ്ചാത്തലവും അദ്ദേഹം കൊണ്ടുവരുന്നു.",
        "type": "പ്രതിരോധ മന്ത്രാലയം"
      },
      {
        "ln_code": "mr",
        "content": "लेफ्टनंट जनरल वीरेंद्र वत्स हे लेफ्टनंट जनरल गुरबीरपाल सिंग यांच्याकडून 01 ऑक्टोबर 2025 रोजी राष्ट्रीय कॅडेट कॉर्प्स (NCC) चे महासंचालक बनले. NCC ही जगातील सर्वात मोठी गणवेशधारी युवा संघटना 28 राज्ये आणि 8 केंद्रशासित प्रदेशांमध्ये 20 लाखांपर्यंत कॅडेटची संख्या वाढवत असताना त्यांनी या भूमिकेत पाऊल ठेवले. एकता आणि शिस्त या ब्रीदवाक्यासह, NCC Viksit Bharat@2047 सोबत पुढे जात आहे, त्यात नावीन्य, डिजिटल कौशल्ये आणि जागतिक जागरूकता जोडून चारित्र्य निर्माण आणि देशभक्ती यावर दीर्घकाळ लक्ष केंद्रित केले आहे. 17 डिसेंबर 1988 रोजी ते भारतीय सैन्याच्या 19 कुमाऊं रेजिमेंटमध्ये सामील झाले आणि त्यांची 37 वर्षांची विशिष्ट सेवा आहे. त्यांनी कठोर काउंटर इनसर्जन्सी आणि काउंटर टेररिझम सेटिंग्जमध्ये काम केले आहे आणि अरुणाचल प्रदेश, काश्मीर खोरे आणि लष्कराच्या मुख्यालयात महत्त्वाची पदे भूषवली आहेत. डेमोक्रॅटिक रिपब्लिक ऑफ काँगोमधील संयुक्त राष्ट्र मिशनमध्ये त्यांनी इन्फंट्री ब्रिगेडचे नेतृत्व केले. याआधी ते वेलिंग्टनमधील डिफेन्स सर्व्हिसेस स्टाफ कॉलेजचे कमांडंट होते. त्यांनी खडकवासला येथील राष्ट्रीय संरक्षण प्रबोधिनीत शिक्षण घेतले; इंडियन मिलिटरी अकादमी, डेहराडून; संरक्षण व्यवस्थापन महाविद्यालय, सिकंदराबाद; आणि नॅशनल डिफेन्स कॉलेज, नवी दिल्ली. लेफ्टनंट जनरल वीरेंद्र वत्स यांची ऑपरेशन्स आणि नेतृत्वाची व्यापक पार्श्वभूमी आहे. त्याचा अनुभव आणि दृष्टी NCC ला नवीन उर्जेसह मार्गदर्शन करेल, देशासाठी शिस्तबद्ध, जबाबदार आणि भविष्यासाठी तयार तरुण विकसित करण्यात त्याची भूमिका मजबूत करेल अशी अपेक्षा आहे. *** SR/KB",
        "title": "लेफ्टनंट जनरल वीरेंद्र वत्स नॅशनल कॅडेट कॉर्प्सचे महासंचालक बनले आहेत",
        "summary": "लेफ्टनंट जनरल वीरेंद्र वत्स यांनी 01 ऑक्टोबर 2025 पासून नॅशनल कॅडेट कॉर्प्स (NCC) चे महासंचालक म्हणून पदभार स्वीकारला आहे. त्यांनी 37 वर्षांची विशिष्ट सेवा आणि ऑपरेशन्स आणि नेतृत्वाची व्यापक पार्श्वभूमी या भूमिकेत आणली आहे.",
        "type": "संरक्षण मंत्रालय"
      },
      {
        "ln_code": "kn",
        "content": "ಲೆಫ್ಟಿನೆಂಟ್ ಜನರಲ್ ವೀರೇಂದ್ರ ವಾಟ್ಸ್ ಅವರು ಅಕ್ಟೋಬರ್ 01, 2025 ರಂದು ನ್ಯಾಷನಲ್ ಕೆಡೆಟ್ ಕಾರ್ಪ್ಸ್ (NCC) ನ ಡೈರೆಕ್ಟರ್ ಜನರಲ್ ಆದರು, ಲೆಫ್ಟಿನೆಂಟ್ ಜನರಲ್ ಗುರ್ಬೀರ್ಪಾಲ್ ಸಿಂಗ್ ಅವರಿಂದ ಅಧಿಕಾರ ವಹಿಸಿಕೊಂಡರು. ವಿಶ್ವದ ಅತಿದೊಡ್ಡ ಸಮವಸ್ತ್ರಧಾರಿ ಯುವ ಸಂಘಟನೆಯಾದ ಎನ್‌ಸಿಸಿ ತನ್ನ ಕೆಡೆಟ್ ಸಂಖ್ಯೆಯನ್ನು 28 ರಾಜ್ಯಗಳು ಮತ್ತು 8 ಕೇಂದ್ರಾಡಳಿತ ಪ್ರದೇಶಗಳಲ್ಲಿ 20 ಲಕ್ಷಕ್ಕೆ ಹೆಚ್ಚಿಸುತ್ತಿರುವಾಗ ಅವರು ಪಾತ್ರಕ್ಕೆ ಹೆಜ್ಜೆ ಹಾಕಿದರು. ಏಕತೆ ಮತ್ತು ಶಿಸ್ತಿನ ಧ್ಯೇಯವಾಕ್ಯದೊಂದಿಗೆ, NCC ವಿಕ್ಷಿತ್ ಭಾರತ್ @ 2047 ನೊಂದಿಗೆ ಮುನ್ನಡೆಯುತ್ತಿದೆ, ವ್ಯಕ್ತಿತ್ವ ನಿರ್ಮಾಣ ಮತ್ತು ದೇಶಭಕ್ತಿಯ ಮೇಲೆ ತನ್ನ ದೀರ್ಘಕಾಲೀನ ಗಮನಕ್ಕೆ ನಾವೀನ್ಯತೆ, ಡಿಜಿಟಲ್ ಕೌಶಲ್ಯಗಳು ಮತ್ತು ಜಾಗತಿಕ ಜಾಗೃತಿಯನ್ನು ಸೇರಿಸುತ್ತದೆ. ಅವರು ಡಿಸೆಂಬರ್ 17, 1988 ರಂದು ಭಾರತೀಯ ಸೇನೆಯ 19 ಕುಮಾನ್ ರೆಜಿಮೆಂಟ್‌ಗೆ ಸೇರಿದರು ಮತ್ತು 37 ವರ್ಷಗಳ ವಿಶಿಷ್ಟ ಸೇವೆಯನ್ನು ಹೊಂದಿದ್ದಾರೆ. ಅವರು ಕಠಿಣ ಬಂಡಾಯ ಮತ್ತು ಭಯೋತ್ಪಾದನೆ ನಿಗ್ರಹ ಸೆಟ್ಟಿಂಗ್‌ಗಳಲ್ಲಿ ಕೆಲಸ ಮಾಡಿದ್ದಾರೆ ಮತ್ತು ಅರುಣಾಚಲ ಪ್ರದೇಶ, ಕಾಶ್ಮೀರ ಕಣಿವೆ ಮತ್ತು ಸೇನಾ ಪ್ರಧಾನ ಕಚೇರಿಗಳಲ್ಲಿ ಪ್ರಮುಖ ಹುದ್ದೆಗಳನ್ನು ಅಲಂಕರಿಸಿದ್ದಾರೆ. ಅವರು ಕಾಂಗೋ ಪ್ರಜಾಸತ್ತಾತ್ಮಕ ಗಣರಾಜ್ಯದಲ್ಲಿ ವಿಶ್ವಸಂಸ್ಥೆಯ ಕಾರ್ಯಾಚರಣೆಯಲ್ಲಿ ಪದಾತಿ ದಳವನ್ನು ಮುನ್ನಡೆಸಿದರು. ಇದಕ್ಕೂ ಮೊದಲು, ಅವರು ವೆಲ್ಲಿಂಗ್ಟನ್‌ನ ರಕ್ಷಣಾ ಸೇವೆಗಳ ಸಿಬ್ಬಂದಿ ಕಾಲೇಜಿನ ಕಮಾಂಡೆಂಟ್ ಆಗಿದ್ದರು. ಅವರು ಖಡಕ್ವಾಸ್ಲಾದ ನ್ಯಾಷನಲ್ ಡಿಫೆನ್ಸ್ ಅಕಾಡೆಮಿಯಲ್ಲಿ ಅಧ್ಯಯನ ಮಾಡಿದರು; ಇಂಡಿಯನ್ ಮಿಲಿಟರಿ ಅಕಾಡೆಮಿ, ಡೆಹ್ರಾಡೂನ್; ಕಾಲೇಜ್ ಆಫ್ ಡಿಫೆನ್ಸ್ ಮ್ಯಾನೇಜ್ಮೆಂಟ್, ಸಿಕಂದರಾಬಾದ್; ಮತ್ತು ರಾಷ್ಟ್ರೀಯ ರಕ್ಷಣಾ ಕಾಲೇಜು, ನವದೆಹಲಿ. ಲೆಫ್ಟಿನೆಂಟ್ ಜನರಲ್ ವೀರೇಂದ್ರ ವಾಟ್ಸ್ ಅವರು ಕಾರ್ಯಾಚರಣೆ ಮತ್ತು ನಾಯಕತ್ವದಲ್ಲಿ ವಿಶಾಲ ಹಿನ್ನೆಲೆ ಹೊಂದಿದ್ದಾರೆ. ಅವರ ಅನುಭವ ಮತ್ತು ದೂರದೃಷ್ಟಿಯು ಎನ್‌ಸಿಸಿಗೆ ತಾಜಾ ಶಕ್ತಿಯೊಂದಿಗೆ ಮಾರ್ಗದರ್ಶನ ನೀಡುತ್ತದೆ, ದೇಶಕ್ಕಾಗಿ ಶಿಸ್ತುಬದ್ಧ, ಜವಾಬ್ದಾರಿಯುತ ಮತ್ತು ಭವಿಷ್ಯದ-ಸಿದ್ಧ ಯುವಕರನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸುವಲ್ಲಿ ಅದರ ಪಾತ್ರವನ್ನು ಬಲಪಡಿಸುತ್ತದೆ. *** SR/KB",
        "title": "ಲೆಫ್ಟಿನೆಂಟ್ ಜನರಲ್ ವೀರೇಂದ್ರ ವಾಟ್ಸ್ ನ್ಯಾಷನಲ್ ಕೆಡೆಟ್ ಕಾರ್ಪ್ಸ್‌ನ ಡೈರೆಕ್ಟರ್ ಜನರಲ್ ಆಗುತ್ತಾರೆ",
        "summary": "ಲೆಫ್ಟಿನೆಂಟ್ ಜನರಲ್ ವೀರೇಂದ್ರ ವಾಟ್ಸ್ ಅವರು ಅಕ್ಟೋಬರ್ 01, 2025 ರಂತೆ ನ್ಯಾಷನಲ್ ಕೆಡೆಟ್ ಕಾರ್ಪ್ಸ್ (NCC) ನ ಡೈರೆಕ್ಟರ್ ಜನರಲ್ ಆಗಿ ಅಧಿಕಾರ ವಹಿಸಿಕೊಂಡಿದ್ದಾರೆ. ಅವರು 37 ವರ್ಷಗಳ ವಿಶಿಷ್ಟ ಸೇವೆ ಮತ್ತು ಕಾರ್ಯಾಚರಣೆಗಳು ಮತ್ತು ನಾಯಕತ್ವದಲ್ಲಿ ವಿಶಾಲ ಹಿನ್ನೆಲೆಯನ್ನು ಪಾತ್ರಕ್ಕೆ ತರುತ್ತಾರೆ.",
        "type": "ರಕ್ಷಣಾ ಸಚಿವಾಲಯ"
      },
      {
        "ln_code": "ur",
        "content": "لیفٹیننٹ جنرل ویرندر وٹس 01 اکتوبر 2025 کو ایل ٹی جنرل گربیرپل سنگھ سے اقتدار سنبھال کر نیشنل کیڈٹ کور (این سی سی) کے ڈائریکٹر جنرل بنے۔ وہ اس کردار میں قدم رکھتا ہے جب دنیا کی سب سے بڑی وردی والی نوجوان تنظیم این سی سی ، اپنی کیڈٹ کی تعداد کو 28 ریاستوں اور 8 مرکزی علاقوں میں 20 لاکھ تک بڑھا رہی ہے۔ نعرے اتحاد اور نظم و ضبط کے ساتھ ، این سی سی VIKSIT بھارت@2047 کے ساتھ آگے بڑھ رہی ہے ، جس میں کردار کی تعمیر اور حب الوطنی پر اپنی طویل المیعاد توجہ میں جدت ، ڈیجیٹل مہارت اور عالمی سطح پر آگاہی کا اضافہ کیا گیا ہے۔ انہوں نے 17 دسمبر 1988 کو ہندوستانی فوج کے 19 کمون رجمنٹ میں شمولیت اختیار کی اور اس کی 37 سال کی ممتاز خدمات ہیں۔ انہوں نے سخت کاؤنٹر شورش اور دہشت گردی کی رواج کی ترتیبات میں کام کیا ہے اور اروناچل پردیش ، وادی کشمیر ، اور آرمی ہیڈ کوارٹر میں اہم عہدے پر فائز ہیں۔ انہوں نے جمہوری جمہوریہ کانگو میں اقوام متحدہ کے مشن میں انفنٹری بریگیڈ کی بھی قیادت کی۔ اس سے پہلے ، وہ ویلنگٹن میں دفاعی خدمات کے اسٹاف کالج کے کمانڈنٹ تھے۔ انہوں نے نیشنل ڈیفنس اکیڈمی ، کھڈکواسلا میں تعلیم حاصل کی۔ انڈین ملٹری اکیڈمی ، دہرادون ؛ کالج آف ڈیفنس مینجمنٹ ، سیکندرآباد ؛ اور نیشنل ڈیفنس کالج ، نئی دہلی۔ ایل ٹی جنرل ویرندر ویٹس کا آپریشنز اور قیادت میں ایک وسیع پس منظر ہے۔ اس کے تجربے اور وژن سے توقع کی جارہی ہے کہ وہ این سی سی کو تازہ توانائی کے ساتھ رہنمائی کرے گا ، جس سے ملک کے لئے نظم و ضبط ، ذمہ دار اور مستقبل کے لئے تیار نوجوانوں کی ترقی میں اس کے کردار کو تقویت ملے گی۔ *** ایس آر/کے بی",
        "title": "لیفٹیننٹ جنرل ویرندر وٹس نیشنل کیڈٹ کور کے ڈائریکٹر جنرل بن گئے",
        "summary": "لیفٹیننٹ جنرل ویرندر وٹس نے 01 اکتوبر 2025 تک نیشنل کیڈٹ کور (این سی سی) کے ڈائریکٹر جنرل کے عہدے کا عہدہ سنبھال لیا ہے۔ وہ 37 سال کی ممتاز خدمات اور کاموں اور قیادت میں ایک وسیع پس منظر کو اس کردار میں لایا ہے۔",
        "type": "وزارت دفاع"
      }
    ]
  }