[
    {
        "id": "68d790e75dc2e33466504b21",
        "title": "PM shares article on BSNL’s 4G as made in India",
        "content": "Prime Minister Narendra Modi shared an article that shows how BSNL’s 4G network reflects the spirit of self‑reliance. He replied to a post by Minister Jyotiraditya Scindia on X, saying: “Scindia highlights that BSNL’s 4G network shows self‑reliance. With more than 92,000 sites that connect 22 million people, it shows India’s move from dependence to confidence, creating jobs, boosting exports, strengthening the economy and supporting the goal of a self‑reliant India.”",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172052"
    },
    {
        "id": "68d790f85dc2e33466504b22",
        "title": "National Ayurveda School and AIIA hold two‑day training on bone points in Delhi",
        "content": "Rashtriya Ayurveda Vidyapeeth (RAV) in New Delhi, together with the All India Institute of Ayurveda (AIIA), organized a two‑day training program on Asthi Marma at AIIA, New Delhi. The program was opened by Padma Shri and Padma Bhushan awardee Vaidya Shri Devendra Triguna, President of the RAV Governing Body, in the presence of Dr. Mahesh Vyas, Dean of AIIA. In his opening speech, Vaidya Shri Devendra Triguna talked about the importance of Ayurveda in today’s health care and stressed the need to update traditional knowledge to meet current health problems. He also pointed out the many opportunities for Ayurveda practitioners and highlighted how special training like this can improve clinical practice. The training was led by experts such as Dr. C. Suresh Kumar and Dr. N.V. Sreevaths, both CRAV Gurus, Dr. P. Hemantha Kumar, Pro‑Vice Chancellor of NIA Jaipur, and Dr. Anandaram Sharma, Professor and Head of the Panchakarma Department at AIIA, New Delhi. On day one, participants learned about the principles and practices of Asthi Marma, with a mix of theory and real‑life examples. The knowledge shared by the experts set a solid base for the hands‑on sessions that followed. The two‑day program aims to give participants better skills and knowledge, helping to promote evidence‑based Ayurveda and strengthen its role in holistic health care.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172037"
    },
    {
        "id": "68d791115dc2e33466504b23",
        "title": "World Food India 2025",
        "content": "On Day 2 of World Food India 2025, we saw big progress toward making India a leading food source for the world. Discussions focused on sustainability, technology, investment and global partnerships. The event was held at Bharat Mandapam with top officials, industry leaders, startups and policymakers. Sessions included partners from Uttar Pradesh, Gujarat, Punjab, Jharkhand, Bihar and countries like New Zealand, Vietnam, Japan and Russia, as well as talks by the Ministry of Agriculture and Farmers’ Welfare, Ministry of AYUSH, APEDA and the World Bank. The Ministry of Food Processing Industries organized 13 sessions on topics such as pet food, nutraceuticals, specialty foods, alcoholic drinks and plant‑based foods, covering this year's five key focus areas. Twenty‑one companies signed agreements worth more than ₹25,000 crore. The total value of agreements signed on Days 1 and 2 exceeded ₹1 lakh crore. The summit also held key government meetings with Russia and Portugal to boost cooperation in agriculture and food processing. Along with World Food India, two other major events are happening: the 3rd Global Food Regulators Summit by FSSAI, which brings together regulators to align food safety standards, and the 24th India International Seafood Show by SEAI, which highlights India’s growing seafood exports and global market links. The event encouraged all industry players to invest in food processing innovations. It reinforced that India is ready and open for investment, urging global partners to use new technologies, share knowledge and join India’s journey from food security to nutrition security.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172036"
    },
    {
        "id": "68d791285dc2e33466504b24",
        "title": "Ministry launches ‘Sabki Yojana, Sabka Vikas’ campaign on Oct 2, 2025",
        "content": "The Ministry of Panchayati Raj will launch the People’s Plan Campaign (PPC) 2025‑26, called ‘Sabki Yojana, Sabka Vikas’, on 2 October 2025 in all states and union territories. The campaign starts the work of creating Panchayat Development Plans (PDPs) for the 2026‑27 financial year. Since 2018, the PPC has helped Panchayats write evidence‑based, inclusive plans that reflect local priorities and align with national goals through special Gram Sabha meetings. This strengthens community planning and local institutions.\n\nAccording to the eGramSwaraj portal, more than 18.13 lakh PDPs—covering Gram, Block, and District levels—have been uploaded since 2019‑20, and over 2.52 lakh plans belong to the current 2025‑26 exercise. The Ministry is holding virtual meetings with state and UT departments and stakeholders to prepare. On 26 September 2025, Shri Sushil Kumar Lohani, Additional Secretary of MoPR, met with states/UTs and State Institutes of Rural Development & Panchayati Raj to review progress and share the rollout plan.\n\nTo ensure participation, MoPR asked 20 line ministries to direct their departments to be active in special Gram Sabha meetings. States and UTs were asked to set up monitoring platforms, appoint nodal officers, train facilitators, finalize Gram Sabha schedules, and put up public information boards by the end of September.\n\nThe special Gram Sabhas on 2 October 2025 will officially start the PPC. The campaign aims to make local governance participatory, transparent, and accountable. Gram Sabhas will review past plans using digital tools like eGramSwaraj, Meri Panchayat App, and Panchayat NIRNAY, check progress, fix delays, and plan unfinished work using remaining Central Finance Commission grants. Planning will use the Panchayat Advancement Index, use SabhaSaar effectively, grow own-source revenue, and involve more community members.\n\nSpecial focus will be on tribal empowerment under the Adi Karmayogi Abhiyaan, making Gram Sabhas decisive forums for inclusive development that match national goals. With active participation from Panchayat representatives, line departments, community members, and frontline staff, the campaign should improve transparency, convergence, and accountability in planning, leading to better services and outcomes in rural areas.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172058"
    },
    {
        "id": "68d7913c5dc2e33466504b25",
        "title": "Invite comments on draft ISI Bill 2025",
        "content": "On 25 September 2025 the Ministry of Statistics and Programme Implementation (MoSPI) released a draft bill to make the Indian Statistical Institute (ISI) a national institute. The draft invites comments from anyone who cares, as part of the pre‑law consultation. ISI was started in December 1931 and has grown into one of India’s most respected schools and research centres. In 1959 Parliament passed the Indian Statistical Institute Act, declaring ISI an Institution of National Importance. Today ISI offers bachelor’s and master’s programmes in Statistics, Maths, Economics, Computer Science, Library Science, Cryptology, Quality Management and Operations Research. It also runs research, diploma and certificate courses. With about 1,200 students at its campuses, ISI helps India lead in statistical science and related fields.\n\nFour review groups have looked at how ISI works. The latest, led by Dr R A Mashelkar in 2020, said ISI needs big changes in governance, more courses and a stronger position worldwide. The group said ISI must rethink, rebuild and reposition itself to stay a leader when it turns 100 in 2031. To do this, a new law is being drafted that would bring ISI’s act up to the level of other national‑importance institutes, give the governing board clearer powers, and make it smaller and stronger. The aim as ISI nears its 100th year is to make it one of the best institutes in the world, not just in India.\n\nThe draft bill is based on four key ideas:\n(a) Excellence – promote strong academics, global competition and new ideas.\n(b) Good governance – create clear structures, simplify decisions and keep leaders honest.\n(c) Autonomy – give ISI more control over its daily operations and plans.\n(d) Accountability – keep processes transparent, watch over actions and answer to stakeholders.\n\nThese reforms aim to unlock ISI’s full potential in the 21st century. By putting ISI under the same legal and governance rules as other top institutes, the government wants it to deliver world‑class education, research and policy help. The draft bill and instructions for sending comments can be found on the MoSPI website (https://new.mospi.gov.in). You can email your comments to capisi-mospi[at]gov[dot]in in Word or PDF by 24 October 2025. For other queries: Samrat/Murali/Allen at pibmospi[at]gmail[dot]com.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172078"
    },
    {
        "id": "68d7914d5dc2e33466504b26",
        "title": "India expands medical education",
        "content": "Key Takeaways\n\nIntroduction\nIndia has 1.4 billion people, and it must provide health care for everyone. Many people in remote tribal villages cannot see a good doctor because there are not enough doctors or specialists. To solve this problem, Prime Minister Narendra Modi’s government is building more medical schools and hospitals. On 24 September 2025 the Union Cabinet approved a major plan to add more than 10,000 medical seats in existing government colleges and hospitals, costing ₹15,034 crore over four years. This is part of a bigger goal to create 75,000 new seats in five years.\n\nPrime Minister Modi said: “Approval of Phase‑III of the Centrally Sponsored Scheme will add many PG and UG medical seats. This will improve our health system and strengthen medical education infrastructure. It will make sure every part of India has skilled doctors.”\n\nBackground\nOver the last decade India has grown its medical facilities a lot, but demand still outpaces supply.\n\nWhy it matters\nUniversal health for 1.4 billion people depends on accessible, quality care and a ready, skilled workforce. To reach rural, tribal, and hard‑to‑reach groups, the cabinet approved 5,000 postgraduate and 5,023 undergraduate seats in existing government colleges and hospitals by 2028‑29. The total investment is ₹15,034 crore, from 2025‑26 to 2028‑29. The Union government will fund 68.5 % (₹10,303.20 crore) and the states will cover the rest (₹4,731.30 crore). Each new seat costs about ₹1.5 crore.\n\nGoals\nPrime Minister Modi aims for 75,000 new seats in five years. The approval on 24 September 2025 moves India closer to that target.\n\nBenefits\nMore skilled doctors, especially specialists, will help underserved communities. Using existing facilities is cheaper and helps spread doctors evenly across the country.\n\nIndia’s Growing Medical Infrastructure\nIndia has the most medical colleges (808) and keeps expanding. Today there are 123,700 MBBS seats. In the past decade 69,352 new seats were added— a 127 % increase. Post‑graduation seats grew by 143 % with 43,041 added. Twenty‑two new All India Institutes of Medical Sciences (AIIMS) were approved under the Pradhan Mantri Swasthya Suraksha Yojana to improve tertiary care and medical education.\n\nThe National Medical Commission issued new faculty regulations in July 2025 to broaden the pool of eligible teachers and to support the expansion of MBBS and MD/MS seats.\n\nConclusion\nAdding 10,023 seats is another step toward universal health care. It shows the government’s commitment to fixing the shortage of health workers, especially in rural and tribal areas, and will help India become a global medical hub. The changes will raise education standards, create jobs in health, and most importantly, improve health outcomes for millions of people who previously lacked good care.\n\nReferences\nClick here to see PDF. ****** SK/RK",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172069"
    },
    {
        "id": "68d7bac409517297aa10e998",
        "title": "PM Modi opens huge development projects in Jharsuguda, Odisha",
        "content": "Prime Minister Narendra Modi opened and laid the foundation stone for development projects worth more than 50,000 crore rupees in Jharsuguda, Odisha. He greeted dignitaries and spoke about the Navratri festival, his visit to Maa Samalei and Maa Ramachandi temples, and the importance of mothers and sisters. Modi said that after the 2014 elections people wanted a developed Odisha and the state is now growing fast with help from the centre and the state government. He announced new projects worth thousands of crores, launched a new BSNL brand and its first fully Indian 4G network, and started the expansion of IITs across India.  \n\nHe also highlighted several projects in Odisha for education, skill development, and connectivity, and started the Amrit Bharat train between Berhampur and Surat. The rail minister and other ministers joined virtually.  \n\nModi noted the government has already built more than four crore pucca houses for poor families and said that thousands of new houses were being built in Odisha. He praised the chief minister and the team for their work. Nearly 50,000 families now have approval for new homes and over 40,000 tribal families have houses under the Janman Yojana.  \n\nHe said Odisha has a lot of talent and the government will bring big projects like two semiconductor units, a semiconductor park, and a shipbuilding package worth 70,000 crore. He mentioned a corridor from Paradip to Jharsuguda and the importance of shipbuilding for trade and security. The shipbuilding plan could bring 4.5 lakh crore in investment and create millions of jobs.  \n\nModi talked about self‑reliance: BSNL’s 4G was made in India, and India is one of five countries to launch an all‑indigenous 4G network. The 4G towers in Jharsuguda will give high‑speed internet to about 30,000 villages and help people in remote areas, farmers, students, doctors, and the armed forces.  \n\nHe highlighted the 5G rollout, the MERITE scheme to upgrade engineering colleges, and the new Odisha Skill Development Project. Wi‑Fi was installed in 130 higher‑education institutes. He also upgraded MKCG Medical College and VIMSAR to world‑class hospitals.  \n\nModi praised tax reforms: people earn up to 12 lakh rupees now pay no income tax, and GST cuts saved farmers, traders, and families. He said the government keeps lowering taxes on many items and that the GST Savings Festival helps mothers and daughters.  \n\nHe mentioned health programs: the Ayushman Bharat Yojana gives free treatment up to 5 lakh rupees, and the “Swasth Nari, Sashakt Parivar” campaign organized over 8 lakh camps and screened more than 3 crore women.  \n\nHe said Odisha has 6 Vande Bharat trains and is getting more revenue from mining. He assured that development will accelerate. He concluded with best wishes.\n\nDignitaries present: Governor Hari Babu Kambhampati, Chief Minister Mohan Charan Majhi, Union Minister Jual Oram, and many others.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172114"
    },
    {
        "id": "68d7baf409517297aa10e999",
        "title": "National Ayurveda Institute partners with AIIA for two-day training on bone points in Delhi",
        "content": "Rashtriya Ayurveda Vidyapeeth (RAV) in New Delhi, together with the All India Institute of Ayurveda (AIIA), ran a two‑day training course on Asthi Marma at AIIA. The course was opened by Vaidya Shri Devendra Triguna, a Padma Shri and Padma Bhushan awardee and President of RAV’s Governing Body, with Dr. Mahesh Vyas, Dean of AIIA, in attendance. In his opening speech, Dr. Triguna talked about how Ayurveda fits into modern health care and stressed the need to build on traditional knowledge to solve today’s health problems. He also pointed out many opportunities for Ayurveda doctors and said that special training programs like this can improve clinical practice. The sessions were led by well‑known experts such as Dr. C. Suresh Kumar and Dr. N.V. Sreevaths, both CRAV Gurus, Dr. P. Hemantha Kumar, Pro‑Vice Chancellor of NIA Jaipur, and Dr. Anandaram Sharma, Professor and Head of the Panchakarma Department at AIIA. On day one, participants learned detailed information about the principles and methods of Asthi Marma, mixing theory with real‑world applications. The experts’ knowledge gave a solid base for interactive and hands‑on sessions that followed. The two‑day program aims to give participants better skills and knowledge, helping to promote evidence‑based Ayurveda and strengthen its role in holistic health care. *** RT/GS/SG",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172037"
    },
    {
        "id": "68d7bb0609517297aa10e99a",
        "title": "Finance Minister Nirmala Sitharaman opens 4th Kautilya Economic Conclave in Delhi, Oct 3‑5, 2025",
        "content": "Union Minister Nirmala Sitharaman will open the Fourth Kautilya Economic Conclave (KEC 2025) on 3 October 2025 in New Delhi. Union Minister Jaishankar will close the event on 5 October 2025, discussing India’s foreign and economic policies. The KEC 2025 will run from 3–5 October at the Taj Palace in New Delhi.\n\nSpecial lunch sessions will include a forward‑looking talk on “Communications: Emerging Technologies,” led by Communications Minister Jyotiraditya Scindia with AI and digital experts.\n\nThe conclave will finish with a high‑level meeting on global macroeconomic prudence, chaired by Dr. P.K. Mishra, Principal Secretary to the Prime Minister. It will bring senior policymakers and economists together to assess the global economy and needed financial reforms.\n\nThis year’s theme, “Seeking Prosperity in Turbulent Times,” fits India’s growth goals and its ability to navigate uncertainty, turbulence and changing geopolitics.\n\nWith 75 overseas participants from more than 30 countries, the KEC has grown in quality and global presence. The agenda mixes immediate policy priorities with longer‑term changes. Sessions will cover Asia’s rise as a growth hub, the changing BRICS structure, financial stability and new industrial policy directions.\n\nHighlights include a discussion between Banque de France Honorary Governor Jean‑Claude Trichet and RBI Governor Sanjay Malhotra about central banking in hard times. Other guests are former Indonesian Trade Minister Mari Elka Pangestu, Japanese LDP member Taro Kono, Tsinghua University economics dean Bai Chong‑En, UK House of Lords member Karan Bilimoria, LSE public policy dean Andres Velasco, LSE economics professor Nick Stern and former Banque de France Deputy Governor Jean‑Pierre Landau.\n\nLegal experts Larry Kramer, President of LSE, and Harish Salve, former Indian Solicitor General, will talk about how legal reforms can support growth and strengthen the rule of law, chaired by Shaktikanta Das, Principal Secretary‑II to the PM.\n\nOther panels will discuss universal health care, jobs for youth, urbanisation, trade and regional integration and the risks and benefits of new technologies.\n\nNetworking breaks, special sessions and interactive formats over three days will encourage open, solution‑focused discussions.\n\nKEC 2025 aims to blend India’s priorities with global views, charting a path to prosperity amid turbulence. Each year’s theme addresses current challenges. The 2022 edition, “Redefining the Future,” had participants from 21 countries and covered technology, climate and fiscal policy, plus a lecture by Tharman Shanmugaratnam. In 2023, “Navigating a World on Fire” focused on MDB reform, climate finance and geopolitical turbulence. The 2024 conclave, “The Indian Era,” deepened debates on green transition, Asia’s rise and multilateralism.\n\nThe KEC is a premier forum for open, cross‑border dialogue. Full records of past editions are on the IEG website. The Institute of Economic Growth, led by N.K. Singh, started the Kautilya Economic Conclave in 2022 with the Finance Ministry. The conclave is invite‑only.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172102"
    },
    {
        "id": "68d7bb1609517297aa10e99b",
        "title": "World Food India 2025 event",
        "content": "On the second day of World Food India 2025, we saw big progress in making India a leading food country. The talks focused on sustainability, technology, investment, and global partnerships. The event was held at Bharat Mandapam and drew top officials, regulators, industry leaders, startups, and policy makers. Sessions were organized by partner states — Uttar Pradesh, Gujarat, Punjab, Jharkhand, and Bihar — and by countries such as New Zealand, Vietnam, Japan, and Russia. The Ministry of Agriculture and Farmers’ Welfare, Ministry of AYUSH, APEDA, and the World Bank hosted sessions. MOFPI ran 13 sessions on topics like pet food, nutraceuticals, speciality foods, alcohol, and plant‑based foods, covering the year’s five key pillars. The Ministry of Food Processing Industries signed agreements with 21 companies, investing over ₹25,000 crore. Total agreements on Days 1 and 2 exceeded ₹1 lakh crore. The summit also included government talks with Russia and Portugal to boost cooperation in agriculture and food processing. In addition to World Food India, two other major events ran at the same time: the 3rd Global Food Regulators Summit by FSSAI, which aims to harmonise food‑safety standards, and the 24th India International Seafood Show by the Seafood Exporters Association of India, which highlights India’s seafood export growth and global market links. The event urged all stakeholders to invest in food‑processing innovations, reinforced India’s reputation as a welcoming and investment‑ready place, and called on global partners to use innovations, share technology and knowledge, and join India’s move from food security to nutrition security.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172036"
    },
    {
        "id": "68d7bb2809517297aa10e99c",
        "title": "Clean City Pairs",
        "content": "The Ministry of Housing and Urban Affairs (MoHUA) has started the Swachh Shehar Jodi (SSJ) program. It is a mentorship and teamwork plan that connects 72 leading cities with about 200 cities that need help. Cities that did well in the latest Swachh Survekshan rankings are chosen as mentors and paired with cities that performed poorly. The program is part of the Swachh Bharat Mission – Urban (SBM-U). Union Minister Shri Manohar Lal announced SSJ in front of senior officials, state leaders, mayors, and other government officers. A Memorandum of Understanding (MoU) was signed between the mentor and mentee cities at a national event in Sonipat. SSJ is one of the biggest structured mentorship programs in India’s city waste‑management sector. It aims to share knowledge, encourage peer learning, and spread good practices in cleanliness and waste handling across urban areas.\n\nOver the years, many cities have shown outstanding results in the world’s biggest city sanitation survey, Swachh Survekshan. These cities have high citizen participation, strong governance, and have overcome many challenges. Because of this, people have been talking about expanding these best practices to other cities. To support this, the Super Swachh League was created in the current year’s Swachh Survekshan. Cities that finished first, second, or third in 2022, 2023, and 2024 were added to the league across five population categories. The goal is to push top cities to aim for higher standards and to motivate other cities to climb the rankings.\n\nThe mentor cities are the best cities that are part of the Super Swachh League, the top three cities in each population group in 2024, and promising clean cities from various states and union territories. Mentee cities are chosen from the lowest ranks in their state’s latest cumulative rankings and are located near their mentor cities.\n\nDuring the launch in Sonipat, Union Minister Shri Manohar Lal talked about the spirit of Antyodaya—ensuring no city is left behind and that all benefit from shared knowledge. He said the Swachh Bharat Mission focuses on building capacity for everyone and that SSJ is a real, time‑bound, results‑driven partnership. Secretary of MoHUA, Shri S. Katikithala, added that SSJ is a dynamic platform for sharing knowledge and supporting each other, with a clear goal that every mentee city will improve its cleanliness by learning from the best.\n\nOn August 26, 2025, MoHUA released official guidelines for the SSJ initiative and officially paired mentor and mentee cities. Mentee cities will learn directly from high‑performing cities and try to copy their best practices. The Ministry also launched a 100‑day program to show how city‑to‑city mentorship can drive urban change. During this period, each mentor–mentee pair will create action plans with clear milestones, focusing on sharing experience and knowledge. MoHUA will give strategic direction and policy support to ensure the SSJ program works well across states. This effort is part of the Swachh Bharat Mission’s capacity‑building initiative. Nearly 300 MoUs were signed across the country at the same time, with all participating cities and their leaders present. This marks the start of a 100‑day phase that will be reviewed in the 2026 Swachh Survekshan. ******** SK",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172112"
    },
    {
        "id": "68d7bb7d09517297aa10e99d",
        "title": "Tourism Ministry celebrates World Tourism Day: Tourism and Sustainable Transformation",
        "content": "On Saturday, September 27, 2025, the Indian government’s Tourism Ministry celebrated World Tourism Day. The theme was “Tourism and Sustainable Transformation.” Leaders from the government, tourism businesses, universities and community groups attended, affirming India’s pledge to share its culture, grow its economy and use tourism to protect the environment.\n\nThe chief guest was Shri Suman Bery, Vice Chairperson of NITI Aayog. The event was led by Shri Suresh Gopi, Minister of State for Tourism, Petroleum & Natural Gas, and Shri Suman Billa, Additional Secretary, Tourism Ministry, who gave the welcome address. They highlighted how tourism can help people, safeguard nature and create jobs.\n\nSuman Bery said tourism is more than a holiday; it can change economies, care for the environment and include everyone. She urged India to put sustainability at the centre of all tourism plans, not just as an afterthought. She stressed the need to combine transport, cities, digital tech and roads so that people can travel easily. Good links by road, rail, air and water will open up more places, spread benefits and ease crowds. Private companies and local communities must work together, investing, protecting nature and making tourism fair.\n\nSuresh Gopi talked about India’s ongoing work on sustainability. He highlighted schemes like Swadesh Darshan 2.0 and PRASHAD that promote eco‑friendly hotels, village tourism and better online tools. He stressed that tourism needs strong ties with transport and infrastructure. India is building airports, highways, waterways and railways to make travel smooth for tourists from all over the world. Projects such as UDAN give better last‑mile access to sites and create hubs where different transport modes meet.\n\nThe day also saw new agreements. The Tourism Ministry signed Memoranda of Understanding with Netflix, the Atithi Foundation and several Online Travel Agencies. Netflix will showcase Indian places through film trailers. The Atithi Foundation and the travel agencies will help research, build skills and gather visitor feedback so states can make better policies.\n\nDuring the event a new Project Management Information System (PMIS) was launched. It is a digital tool that lets people track tourism projects in real time, making the work more efficient and open. The Ministry also released the 66th India Tourism Data Compendium, showing record numbers of visitors, jobs and money made by tourism.\n\nA booklet called “Guide to MUDRA Loans for Homestays” was launched to help people apply for small loans through the Jan Samarth portal.\n\nA senior panel discussed transport and connectivity. Officials from road, aviation, railways and shipping ministries said that easy, multi‑mode links are key to lasting growth.\n\nThe event included talks on examples like Mahakumbh 2025 and the Statue of Unity. Speakers also talked about Destination Management Organisations and how new tech such as AI, AR/VR and digital twins can improve planning and the visitor experience.\n\nOverall, the World Tourism Day 2025 showed India’s determination to use tourism to build a sustainable, inclusive and prosperous future. It highlighted leadership on the global stage, new ideas, teamwork across sectors and a focus on people.\n\nLinks:\n- India Tourism Statistics Compendium 2025\n- Guide to MUDRA Loans for Home‑Stays\n\nContact: Sunil Kumar Tiwari, tourism4pib@gmail.com",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172092"
    },
    {
        "id": "68d7bb8f09517297aa10e99e",
        "title": "India expands medical education",
        "content": "India has 1.4 billion people. Many live in remote villages and tribal areas and cannot access good doctors because there are not enough trained doctors and specialists. To solve this, Prime Minister Narendra Modi’s government is building more medical schools and hospitals. On 24 September 2025 the Union Cabinet approved a plan to add more than 10,000 new medical seats in existing government colleges and hospitals, costing Rs 15,034 crore over four years. The aim is to create 75,000 more seats in the next five years. “Adding Phase‑III of the Centrally Sponsored Scheme will add many PG and UG medical seats. This will improve our healthcare system and strengthen medical education. It will make sure skilled doctors are available in every part of India.” – PM Modi, post on X, 24 September 2025. The country has built many medical facilities in the last decade, but demand still exceeds supply. Universal health for 1.4 billion people needs accessible, quality care and a skilled workforce. The cabinet approved an extra 5,000 postgraduate and 5,023 undergraduate seats in existing government colleges and hospitals by 2028‑29. The total investment is Rs 15,034 crore from 2025‑26 to 2028‑29. The Union government will pay 68.5% (Rs 10,303.20 crore) and the states will pay the rest (Rs 4,731.30 crore). The cost per seat is Rs 1.5 crore. This step moves India closer to its target of 75,000 new seats. Benefits: Underserved communities will get more skilled doctors, especially specialists. Using existing infrastructure saves money and helps spread doctors evenly across regions. India’s growing medical infrastructure: India has the largest number of medical colleges (808) and keeps adding more. Today there are 123,700 MBBS seats. In the last ten years 69,352 new seats were added, a 127% increase. Post‑graduate seats grew by 143% (43,041 added). Twenty‑two new AIIMS were approved under the Pradhan Mantri Swasthya Suraksha Yojana to provide affordable, reliable tertiary care and improve education. The National Medical Commission issued new regulations in July 2025 to broaden the pool of faculty and expand seats in colleges. The aim is 75,000 new seats in five years. Conclusion: The approval of 10,023 additional seats is another step toward universal health care and shows the government’s commitment to solving the shortage of doctors, especially in rural and tribal areas. This will make India a global medical hub and bring better health care for millions who have long lacked quality treatment.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172069"
    },
    {
        "id": "68d7c41d33af6221bd1bd7a3",
        "title": "PM’s speech at Jharsuguda development launch",
        "content": "Jay Jagannath, Jay Maa Samolei, Jay Maa Ramochandi. Some young people have brought many artworks; Odisha is known worldwide for its love of art. I accept this gift and ask my SPG colleagues to gather all the items from you. If you write your name on the back, you will receive a letter from me. A child is standing with something; please collect it as well. I thank all the youth for creating these pieces.\n\nPresent here are Odisha Governor Haribabu, Chief Minister Mohan Chandra Maji, ministers Juel Oram, Deputy CM Prativa Parda, Kanak Vardhan Singh Dev, Parliament members Baijayant Panda, Pradeep Purohit, BJP Odisha Chief Minister Manmohan Samal, and other dignitaries. Many central and state ministers are with us, and I welcome them. I salute my brothers and sisters from Jarasuguda. I appreciate your love.\n\nThe Navaratri festival is underway and I have the honor of seeing Maa Samolai and Maa Ramochandi. Many mothers and sisters have arrived. Your blessings are our strength; I salute all of you.\n\nA year and a half ago, you pledged to move Odisha forward with a new resolve, 'developed Odisha.' Today, we see the 'double engine' of Odisha progressing. New projects worth thousands of crores have started. BSNL has launched a wholly indigenous 4G service. IIT expansions begin today. Multiple education, skill and connectivity projects are launched. The modern Amrit Bharat Train from Barhampur to Surat has been green‑lit. It is important that you stay connected. Gujarat has a large Odia community, especially in Surat. These new direct train services are now available. I congratulate all Odians on these development works.\n\nThe BJP government serves the poor, empowers them, and focuses on basic services for Dalits, backward classes and tribals. Today we saw the handover of the Ananthyod Ghar Yojana certificates. A safe home lifts families into a better future. Our government has already built 40 million homes for the poor, including 100,000 for tribals under PM Janman Yojana. My wishes to all beneficiaries.\n\nI always believed in Odisha's talent. Nature has given much; after decades of poverty, now we move toward prosperity. The central government has approved two semiconductor units in Odisha. Odisha will host a semiconductor park; chips used in phones, TVs, refrigerators, computers and vehicles will soon be produced here. Repeat: Jai Jagannath. Our pledge is self‑reliance from chips to ships. I ask you: should India be self‑reliant? Every citizen wants independence. That is why a massive industrial hub is being built from Pradeep to Jarasuguda.\n\nA country that is self‑reliant in shipbuilding can avoid trade disruptions. Our government approved a 70,000 crore package for shipbuilding, leading to 4.5 lakh crore investment. This will benefit our youth and create jobs, especially in Odisha.\n\nIndia has taken a huge step toward self‑reliance. While 2G, 3G and 4G services came later, BSNL now has an all‑indigenous 4G technology. This benefits our remote areas. Many villages will get high‑speed internet, improving education, agriculture, healthcare and connectivity for soldiers, pilgrims and civilians.\n\nIndia rolled out 5G quickly; BSNL towers will be ready for 5G. We celebrate this historic day. The BJP also prioritises skilled youth and research. We invest in education and skill development, modernise engineering colleges and polytechnics. The Merit scheme will allocate thousands of crores. Young people need not travel to big cities for training.\n\nOur government saves money through GST reforms, reducing tax burdens on families, farmers and businesses. We now have significant GST savings for ordinary families. Farmers save on tractors and machines; tribals receive better prices for forest produce; the government keeps reducing taxes. Congress has not stopped its tax plundering, but the BJP has cut taxes and increased welfare.\n\nWe celebrate the GST savings and support mothers. The IAY scheme provides free medical treatment up to ₹5 lakh. The Healthy Women, Strong Family campaign is underway; over 80 lakh health camps have screened more than 3 crore women for diabetes, cancer, TB etc. I urge all mothers to get screened.\n\nOdisha is progressing: six intercity trains, 60 modernised stations, an airport connecting major cities, increased mining revenue, Sushma plan aid for mothers. Odisha is moving forward on the progress path. I wish you all success. India Mata ki Jai! Jay Jagannath!",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172128"
    },
    {
        "id": "68d7c43733af6221bd1bd7a4",
        "title": "PM Modi starts ₹50,000 crore development in Jharsuguda",
        "content": "Prime Minister Narendra Modi opened and laid foundation stone for development projects worth more than Rs 50,000 crore in Jharsuguda, Odisha. He greeted dignitaries and spoke about Navratri celebrations and his visit to the temples of Maa Samalei and Maa Ramachandi. He praised mothers and sisters, saying their blessings give strength. He recalled 1.5 years ago during the Assembly elections, people promised a new Odisha, and now the state is progressing fast with support from the centre and state governments. He announced many projects for Odisha and the nation, launched BSNL’s new 4G services, and announced the expansion of IITs. He also opened projects in education, skill development and connectivity, and launched the Amrit Bharat train from Berhampur to Surat. He thanked Union Minister Ashwini Vaishnaw, who joined virtually, and congratulated Odisha for its development. The government focuses on helping poor people, Dalits, backward classes and tribal communities. Modi handed over approval letters for the Antyodaya Griha Yojana, noting that a pucca house changes both present and future. The government has built over four crore houses; Odisha is constructing thousands quickly. He said 50,000 families received home approvals, and 40,000 tribal houses were sanctioned. He expressed faith in Odisha’s people. He said Odisha had long suffered poverty, but the next decade will bring prosperity with major projects. The central government approved two semiconductor units and a park in Odisha, citing youth potential, and Modi envisaged chips made in Odisha. He reaffirmed self‑reliance, said the industrial corridor from Paradip to Jharsuguda is under development, and noted shipbuilding’s strategic importance. He announced a ₹70,000 crore shipbuilding package that should attract ₹4.5 lakh crore investment, benefiting steel, machinery, electronics and small industries, creating many jobs and helping Odisha. Modi highlighted India’s progress in telecom; BSNL has 4G technology made in India, and its 25th anniversary was celebrated. BSNL’s 4G network launched in Jharsuguda with about 100,000 towers will connect remote areas, reaching 200+ million people and 30,000 villages that will get high‑speed internet. The initiative also helps farmers, doctors via telemedicine and the armed forces. 5G is ready. He praised skilled youth and research for Atmanirbhar Bharat, launched the MERITE scheme for engineering colleges, and skill development projects. He said investment will keep youth at home. He reflected on the past, saying opposition governments exploited people, but 2014 people gave power to the current government, now there is double savings and earnings. He explained tax changes: those earning up to ₹12 lakh pay no tax; GST reforms saved families ₹15-20k. Farmers now save about ₹40k on tractors, and the government reduced taxes on agricultural tools and cement. He warned that opposition governments still exploit. He emphasized the GST savings festival benefits mothers, and mentioned Ayushman Bharat Yojana’s free treatment up to ₹5 lakh and the “Swasth Nari, Sashakt Parivar” campaign with 800k camps and 3 crore women screened. He urged women to get check‑ups. He said Odisha benefits: six Vande Bharat trains, rail modernization, Veer Surendra Sai Airport connected, and higher mineral revenue. The Subhadra Yojana supports women. He concluded with best wishes. Attendees included Governor Hari Babu Kambhampati, CM Mohan Charan Majhi, Minister Jual Oram, and others; Union Ministers and CM joined via video. Modi laid foundation stone for projects worth over Rs 60,000 crore, including 97,500 4G towers costing about Rs 37,000 crore, digital Bharat Nidhi sites, railway flyover, double line, Manabar–Koraput line, Amrit Bharat Express, IIT expansion, MERITE scheme, Odisha Skill Development Phase II, ITI upgrades, Wi‑Fi for 130 institutions, healthcare upgrades, and Antyodaya houses. *** MJPS/SR",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172114"
    },
    {
        "id": "68d7c44d33af6221bd1bd7a5",
        "title": "PM posts article on BSNL’s 4G being homegrown",
        "content": "Prime Minister Narendra Modi posted an article today that shows how BSNL’s 4G network reflects India’s spirit of self‑reliance. He replied to Union Minister Jyotiraditya M. Scindia’s post on X, saying: ‘Minister Scindia highlights how BSNL’s 4G network embodies the spirit of self‑reliance. With more than 92,000 sites that connect 22 million people, it shows India’s journey from dependence to confidence, creating jobs, boosting exports, supporting the economy, and advancing the goal of a self‑reliant India.’",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172052"
    },
    {
        "id": "68d7c45f33af6221bd1bd7a6",
        "title": "Ayurveda school and AIIA run 2‑day bone‑health training in Delhi",
        "content": "Rashtriya Ayurveda Vidyapeeth (RAV), New Delhi, together with the All India Institute of Ayurveda (AIIA), organized a two‑day training program on Asthi Marma at AIIA, New Delhi. The program was inaugurated by Vaidya Shri Devendra Triguna, a Padma Shri and Padma Bhushan awardee and President of RAV’s Governing Body, in the presence of Dr. Mahesh Vyas, Dean of AIIA. In his opening address, Vaidya Shri Devendra Triguna explained that Ayurveda remains relevant to modern healthcare and urged people to advance traditional knowledge to meet today’s health challenges. He also highlighted the many opportunities for Ayurveda practitioners and stressed that specialized training like this improves clinical practice. The training was led by eminent experts such as Dr. C. Suresh Kumar and Dr. N.V. Sreevaths, both CRAV Gurus, Dr. P. Hemantha Kumar, Pro‑Vice Chancellor of NIA Jaipur, and Dr. Anandaram Sharma, Professor and Head of the Panchakarma Department at AIIA. On day one, participants received in‑depth theory and practical training on Asthi Marma, linking concepts with real clinical application. The knowledge shared by the experts laid a solid foundation for interactive and hands‑on sessions that followed. The two‑day program aims to give participants enhanced skills and knowledge, supporting evidence‑based Ayurveda and strengthening its role in holistic health care. *** RT/GS/SG",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172037"
    },
    {
        "id": "68d7c46d33af6221bd1bd7a7",
        "title": "Coal Ministry plants trees at Indraprastha Park",
        "content": "As part of the ongoing Swachhata Hi Seva 2025 initiative, the Ministry of Coal organised a large plantation drive at Indraprastha Park, Sarai Kale Khan, with the theme \"Ek Ped Maa Ke Naam\" (One Tree in Mother’s Name). The drive followed the Prime Minister’s call to dedicate trees to mothers as a tribute to motherhood and nature, showing the Ministry’s strong commitment to caring for the environment, sustainability and civic duty. It also helped spread the ideas of cleanliness and sustainability into everyday life. By choosing a busy public space in the capital, the Ministry wanted to inspire people and institutions to grow more trees and improve the city’s environment.\n\nThe event was attended by Ms. Rupinder Brar, Additional Secretary of the Ministry, who planted a tree along with Shri Sanjeev Kumar Kassi, Joint Secretary, Shri Ashim Kumar Modi (JS & FA), Dr. Chetna Shukla, DDG, and other senior officers. Their participation showed that the government is working directly on the ground, not just writing policies.\n\nMany saplings – shade trees, flowering trees and fruit trees – were planted to add diversity and ecological benefits to the park. The theme encourages people to plant and care for trees as a sign of respect for mothers and nature. It also supports the values of cleanliness, greenery and ecological balance promoted by Swachhata Hi Seva.\n\nThe Ministry used this event to make environmental conservation personal by asking everyone to plant a tree in their mother’s name. This helps people feel attached to the saplings and take care of them longer. By holding such activities during Swachhata Hi Seva, the Ministry shows that cleanliness, greenery and environmental care are linked pillars of responsible governance.\n\nContinuing the momentum, the Ministry of Coal ran “Shramdaan – Ek Din Ek Ghanta Ek Saath” on 25.09.2025. Ms. Rupinder Brar and other senior officers cleaned the area around Shastri Bhawan. This shows the Ministry’s serious commitment to the campaign’s goals. Through this event, the Ministry sends a clear message that protecting the environment is not only a policy goal but also a moral duty that starts with simple acts like planting a tree. The initiative is expected to inspire similar efforts in coal PSUs and other departments, strengthening the vision of a cleaner, greener, and more sustainable India for future generations.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172127"
    },
    {
        "id": "68d7c47d33af6221bd1bd7a8",
        "title": "Defence Minister opens 2025 National Conclave on India’s growth and veterans",
        "content": "Defense Minister Shri Rajnath Singh will open the National Conclave 2025 organized by the Department of Ex‑Servicemen Welfare (DESW) of the Ministry of Defence. The theme is ‘Developed India and Ex‑Servicemen Welfare’ and it will take place on 29–30 September 2025.\n\nThe event will bring together key people to strengthen national efforts for the well‑being and reintegration of India’s veterans. Secretary (DESW) Dr. Niten Chandra will also attend.\n\nThe conclave will serve as a platform for sharing ideas, where representatives from Rajya Sainik Boards (RSBs) and Zila Sainik Boards (ZSBs) across the country will discuss at the grassroots level. The aim is to exchange best practices, strengthen support mechanisms, and ensure that welfare schemes reach every veteran efficiently.\n\nBesides policy discussions, the conclave will include a recognition ceremony. The Defense Minister will honor distinguished individuals and top‑performing RSBs and ZSBs for their outstanding contributions to ex‑servicemen welfare. This acknowledgment is expected to honor their dedication and inspire others to intensify efforts to empower India’s veterans as key partners in building a Developed India.\nSR/KB",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172131"
    },
    {
        "id": "68d7c48d33af6221bd1bd7a9",
        "title": "Finance Minister starts 4th Kautilya Conclave on prosperity in October",
        "content": "Finance Minister Nirmala Sitharaman will start the fourth Kautilya Economic Conclave (KEC 2025) on 3 October 2025 in New Delhi. External Affairs Minister Dr. S. Jaishankar will close it on 5 October, sharing thoughts on India’s foreign and economic policy. The event runs 3–5 October 2025 at the Taj Palace in New Delhi. A special lunch session will talk about \\\"Communications: Emerging Technologies,\\\" led by Communications Minister Jyotiraditya Scindia, with experts on AI and digital infrastructure. The conclave ends with a high‑level meeting on global economic stability, chaired by Dr. P. K. Mishra, Principal Secretary to the Prime Minister, where senior policymakers and economists will review the world economy and suggest financial reforms. The theme, \\\"Seeking Prosperity in Turbulent Times,\\\" reflects India’s growth goals and its ability to handle uncertainty, turbulence, and changing geopolitics. The KEC has grown in quality and reach, now hosting 75 participants from more than 30 countries to discuss current issues. The agenda mixes urgent policy needs with long‑term changes, covering Asia’s rise as a growth hub, the new BRICS structure, financial stability, and shifts in industrial policy. Highlights include a discussion between Jean‑Claude Trichet, honorary governor of Banque de France, and Sanjay Malhotra, RBI governor, on central banking challenges. Other guests are former Indonesian Trade Minister Mari Elka Pangestu, Japanese LDP member Taro Kono, Tsinghua University dean Bai Chong‑En, UK House of Lords member Karan Bilimoria, LSE policy dean Andres Velasco, LSE economics professor Nick Stern, and former Banque de France deputy governor Jean‑Pierre Landau. Legal experts Larry Kramer, LSE president, and Harish Salve, former Solicitor General, will discuss legal reforms that support growth and rule of law, chaired by Shaktikanta Das, Principal Secretary‑II to the Prime Minister. Other panels cover universal healthcare, youth jobs, urbanisation, trade, regional integration, and the pros and cons of new technologies. Networking breaks, special sessions, and interactive formats over the three days will encourage open, solution‑focused dialogue. KEC 2025 aims to blend India’s priorities with global views and map paths to prosperity amid turbulence. Over the past three years, each edition’s theme addressed current challenges: 2022’s \\\"Redefining the Future\\\" brought 21 countries to discuss technology, climate, and fiscal policy and hosted the first Arun Jaitley Memorial Lecture by Tharman Shanmugaratnam. In 2023, \\\"Navigating a World on Fire\\\" focused on MDB reform, climate finance, and geopolitics. The 2024 conclave, \\\"The Indian Era,\\\" deepened discussions on green transition, Asia’s rise, and multilateralism. The KEC has become a leading venue for candid cross‑border dialogue. Full records are on the IEG website. The Institute of Economic Growth, led by N. K. Singh, started the Kautilya Economic Conclave in 2022 in partnership with the Finance Ministry. It is a by‑invitation event.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172102"
    },
    {
        "id": "68d7c4a133af6221bd1bd7aa",
        "title": "World Food India 2025",
        "content": "On the second day of World Food India 2025, we saw big progress toward making India a leading food country. Discussions focused on sustainability, technology, investment, and partnerships. The event is at Bharat Mandapam with top officials, regulators, industry leaders, startups, and policy makers. Sessions were held with partner states: Uttar Pradesh, Gujarat, Punjab, Jharkhand, Bihar, and countries: New Zealand, Vietnam, Japan, Russia. The Ministry of Agriculture and Farmers’ Welfare, Ministry of AYUSH, APEDA, and World Bank also hosted sessions. MOFPI organized 13 sessions on topics like pet food, nutraceuticals, specialty foods, alcoholic drinks, and plant-based foods, covering the five focus areas of this year. The Ministry of Food Processing Industries signed agreements with 21 companies for investments over ₹25,000 crore. Total agreements on Days 1 & 2 exceeded ₹1 lakh crore. Government meetings were held with Russia and Portugal to strengthen agriculture and food processing ties. Two other events ran with World Food India: the 3rd Global Food Regulators Summit by FSSAI, which brings regulators together to align food safety standards, and the 24th India International Seafood Show by the Seafood Exporters Association of India, focusing on India’s growing seafood export market. The summit called on all industry players to invest in food processing innovations. It highlighted India as a welcoming, investment-ready place, encouraging global partners to use new technologies, share knowledge, and join India’s move from food security to nutrition security.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172036"
    },
    {
        "id": "68d7c4b433af6221bd1bd7ab",
        "title": "Clean City Pair",
        "content": "The Ministry of Housing and Urban Affairs (MoHUA) has started the Swachh Shehar Jodi (SSJ) programme. It pairs 72 mentor cities with about 200 mentee cities. Mentor cities were chosen because they scored high in the Swachh Survekshan ranking. Mentee cities are the ones that scored lowest in their state. The pairing is based on how close the cities are to each other.\n\nThe SSJ programme was launched on the Swachh Bharat Mission – Urban (SBM‑U) track. Union Minister Shri Manohar Lal announced it in Sonipat, with ministers, mayors and the Secretary of MoHUA present. A Memorandum of Understanding (MoU) was signed between each mentor and mentee city at the ceremony.\n\nSSJ is one of the biggest structured mentorship projects for waste management in India. It aims to let cities learn from each other, share best practices, and improve sanitation and waste handling.\n\nThe Super Swachh League was created for the latest Swachh Survekshan (SS). Cities that finished 1st, 2nd or 3rd in 2022, 2023 and 2024, across five population groups, were invited. These top cities are now mentors. They are joined by three cities that performed best in 2024 and by promising clean cities from various states.\n\nOn 26 August 2025, MoHUA issued guidelines that officially matched the mentor and mentee cities. The 100‑day programme will show how city‑to‑city learning can transform cities. Every pair will draft action plans with clear steps. MoHUA will give policy support and keep the programme running across all states.\n\nAlmost 300 MoUs were signed at the same time by the cities and their political leaders. The programme will be reviewed in Swachh Survekshan 2026.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172112"
    },
    {
        "id": "68d7c4c533af6221bd1bd7ac",
        "title": "MoPR launches ‘Everyone’s Plan, Everyone’s Growth’ campaign",
        "content": "The Ministry of Panchayati Raj will launch the People’s Plan Campaign (PPC) 2025‑26, called “Sabki Yojana, Sabka Vikas,” across all states and union territories from 2 October 2025. This starts the work on making Panchayat Development Plans (PDPs) for the fiscal year 2026‑27. Since 2018, the campaign has helped Panchayats create evidence‑based, joint and inclusive PDPs that reflect local needs and align with national goals through special Gram Sabha meetings. The activity deepens community planning and strengthens local bodies nationwide.\n\nAccording to the eGramSwaraj Portal, more than 18.13 lakh PDPs—Gram Panchayat Development Plans, Block Panchayat Development Plans and District Panchayat Development Plans—have been uploaded since 2019‑20, and over 2.52 lakh belong to the current 2025‑26 exercise. The Ministry has begun online meetings with State/UT departments and stakeholders to prepare for PPC 2025‑26.\n\nOn 26 September 2025, Shri Sushil Kumar Lohani, Additional Secretary, MoPR, met states, UTs and State Institutes of Rural Development & Panchayati Raj (SIRD&PRs) online to review progress and share the rollout plan. To ensure local participation, MoPR asked 20 line ministries/departments to direct their State/UT offices to be active in special Gram Sabha meetings. States and UTs were asked to activate monitoring platforms, appoint nodal officers, train facilitators, finalize Gram Sabha schedules, and display public information boards by the end of September.\n\nThe special Gram Sabhas on 2 October 2025 will officially start PPC 2025‑26. PPC 2025‑26: Sabki Yojana, Sabka Vikas aims to make local governance more participatory, transparent and accountable. Gram Sabhas will review earlier GPDPs using digital tools (eGramSwaraj, Meri Panchayat App, Panchayat NIRNAY), assess progress, address delays, and prioritize unfinished work that still has unused Central Finance Commission funds. Planning will use the Panchayat Advancement Index (PAI), ensure proper use of SabhaSaar, improve own source revenue (OSR), and promote wider community participation.\n\nSpecial focus will be on tribal empowerment under the Adi Karmayogi Abhiyaan, making Gram Sabhas decisive forums for inclusive development that align with national goals. With active participation of Panchayat representatives, line departments, community members and front‑line staff, the campaign is expected to strengthen transparency, convergence and accountability in planning, leading to better services and results in rural areas.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172058"
    },
    {
        "id": "68d7c4d733af6221bd1bd7ad",
        "title": "Seeking comments on draft ISI Bill 2025",
        "content": "The Ministry of Statistics and Programme Implementation (MoSPI) of the Government of India has published the draft Indian Statistical Institute Bill, 2025 for public comment on 25 September 2025. All stakeholders and the general public are invited to give their feedback as part of the pre‑law consultation process. The Indian Statistical Institute (ISI) was founded in December 1931 and has become one of India’s most respected academic and research institutions. In recognition of its national contribution, Parliament passed the Indian Statistical Institute Act, 1959, designating ISI as an Institution of National Importance (INI). Today, ISI offers undergraduate and postgraduate courses in Statistics, Mathematics, Quantitative Economics, Computer Science, Library and Information Science, Cryptology and Security, Quality Management Science, and Operations Research. It also runs research projects, diplomas, and certificate programmes. With about 1,200 students at its campuses, ISI plays a key role in advancing India’s leadership in statistical science and related fields. Over the years, four Review Committees have examined ISI’s functioning. The most recent, led by Dr. R.A. Mashelkar in 2020, suggested major reforms to strengthen governance, broaden academic programmes, and make ISI competitive worldwide. The Committee said ISI must re‑imagine, reinvent, and reposition itself to regain its leadership and stay relevant as it reaches its 100th year in 2031. To address this, a new law is proposed that upgrades the current Act to match other INI laws, creating a new governance structure. The Board of Governance will become a smaller, more empowered body that can make policy, administrative, and financial decisions. As ISI approaches its centenary in 2031, the goal is to make ISI one of the best institutes in India and among the world’s top institutes. The draft Bill is based on four guiding principles: (a) Excellence – promote strong academics, global competitiveness, and innovation; (b) Effective Governance – set clear structures, streamline decision‑making, and maintain integrity in leadership and management; (c) Autonomy – give the Institute more decision‑making power in its day‑to‑day operations and planning; (d) Accountability – ensure transparency, oversight, and responsiveness to stakeholders. The reforms aim to unlock ISI’s full potential in the 21st century. By aligning ISI with the legal and governance framework of other INI institutions, the Government intends to strengthen its ability to deliver world‑class education, research, and policy support. The draft Bill and the format for submitting comments are available on the Ministry’s website (https://new.mospi.gov.in). Suggestions may be sent by e‑mail to capisi-mospi@gov.in in MS Word or PDF format by 24 October 2025. *** Samrat/Murali/Allen : pibmospi@gmail.com",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172078"
    },
    {
        "id": "68d7c4ec33af6221bd1bd7ae",
        "title": "Tourism Ministry celebrates World Tourism Day with sustainable tourism theme",
        "content": "On Saturday, September 27, 2025, the Ministry of Tourism, Government of India, marked World Tourism Day 2025. The theme was “Tourism and Sustainable Transformation.” The event brought together people from the government, industry, academia and civil society. It showed that India is serious about cultural exchange, growing the economy and using tourism in an eco‑friendly way.\n\nThe chief guest was Shri Suman Bery, Vice Chairperson of NITI Aayog. Shri Suresh Gopi, Minister of State for Tourism, led the ceremony, and Shri Suman Billa, Additional Secretary, Ministry of Tourism, gave the welcome speech.\n\nThe speakers talked about how tourism can help the economy, protect the environment and include everyone. They said that sustainable tourism can keep wildlife safe while giving people jobs. India can do the same, but sustainability must be the main goal, not a side note.\n\nTo reach this goal, different sectors must work together. Transport, city planning, digital technology and new buildings should all coordinate. Good road, rail, air and water links make travel easier, spread tourists beyond big cities, and reduce crowds at popular sites. Public‑private partnership is essential – businesses invest, communities take part and the environment is protected.\n\nThe Ministry’s Minister of State said India’s plans for 2047, “Viksit Bharat,” will make tourism green, open to all and ready for the future. Communities should not just visit but benefit, and India’s culture and nature should be shown with pride.\n\nHe highlighted schemes like Swadesh Darshan 2.0 and PRASHAD that promote eco‑friendly hotels, rural tourism and better online booking tools. India is building airports, highways, waterways and railways to give a smooth travel experience. Programs such as UDAN improve last‑mile access to tourist spots and create multi‑modal hubs.\n\nDuring the day, several agreements were signed. A partnership with Netflix will showcase Indian destinations through movies and trailers. Agreements with the Atithi Foundation and major online travel agencies will improve research, training and data collection to help states plan better.\n\nA Project Management Information System (PMIS) was launched. It lets officials monitor tourism projects in real time, making work efficient and clear.\n\nThe Ministry also released the 66th India Tourism Data Compendium. It shows record numbers of visitors, jobs created and money earned. India is now 20th in the world for foreign visitors and is still improving its tourism facilities.\n\nA booklet called “Guide to MUDRA Loans for Homestays” was introduced to help people apply for loans online through the Jan Samarth portal.\n\nA panel of senior officials from roads, aviation, railways and shipping discussed how to keep transport links smooth and sustainable.\n\nSessions also looked at projects like Mahakumbh 2025 and the Statue of Unity. They discussed tools such as AI, AR/VR and digital twins to plan and improve visitor experiences.\n\nOverall, World Tourism Day 2025 showed that India is committed to using tourism to build a sustainable, inclusive and prosperous future, while leading the world in new ideas, cooperation and people‑focused growth.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172092"
    },
    {
        "id": "68d7c4fe33af6221bd1bd7af",
        "title": "India expands medical education",
        "content": "Key Takeaways\n\nIntroduction\nIndia has 1.4 billion people and needs universal health coverage. Many people in remote villages and tribal areas cannot get good health care because there are not enough doctors or specialists. To fill this gap, the Prime Minister’s government is building more medical schools and hospitals. On 24 September 2025 the Union Cabinet approved a major plan to add more than 10,000 new medical seats in existing government colleges and hospitals. The plan costs ₹15,034 crore over four years. It is part of a larger goal to create 75,000 extra seats in the next five years.\n\n“Approval of Phase‑III of the Centrally Sponsored Scheme will add many PG and UG medical seats. This will improve our health system and medical education. It will ensure that every part of India has skilled doctors,” said Prime Minister Narendra Modi on X on 24 September 2025.\n\nIndia has expanded its medical facilities in the last decade, but demand still exceeds supply. Universal health coverage for 1.4 billion people requires accessible, high‑quality care and a ready workforce. To help rural, tribal and hard‑to‑reach communities, the Union Cabinet, chaired by Modi, approved 5,000 more post‑graduate seats and 5,023 undergraduate seats in existing government colleges and hospitals by 2028‑29. The total investment is ₹15,034 crore from 2025‑26 to 2028‑29. Of that, 68.5 % (₹10,303.20 crore) comes from the Union government and the rest (₹4,731.30 crore) from the states. The cost per seat is ₹1.5 crore. Modi plans 75,000 new seats in five years, and this new approval moves the country closer to that goal.\n\nBenefits and Impact\nUnderserved areas will gain a skilled medical workforce, especially specialists. Using existing infrastructure is cheaper and helps spread doctors evenly across the country. Other benefits include:\n\nIndia’s Growing Medical Infrastructure\nIndia has the most medical colleges (808) and has been growing its medical education for years. Today there are 123,700 MBBS seats. Over the last decade, 69,352 new seats were added, a 127 % increase. During the same period 43,041 post‑graduate seats were added, a 143 % rise. The Pradhan Mantri Swasthya Suraksha Yojana approved 22 new AIIMS to bring affordable tertiary care and better education to all regions. To support new faculty, the National Medical Commission issued the Medical Institution (Qualifications of Faculty) Regulations, 2025 in July. These rules widen the pool of eligible teachers and allow more MBBS and MD/MS seats, aiming for 75,000 new seats in five years.\n\nConclusion\nThe recent approval of 10,023 extra seats is another step toward universal health care in India. It builds on the country’s past decade of efforts and shows the government’s commitment to fixing the shortage of health workers, especially in rural and tribal areas. This will make India a global medical hub and bring better health outcomes for millions who have long lacked quality care.",
        "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2172069"
    }
]